zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_MC_CGM.h
#define MC_CGM_MUX_10_CSS_SELSTAT_MASK           (0xF000000U)
#define MC_CGM_MUX_10_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_10_CSS_SELSTAT_WIDTH          (4U)
#define MC_CGM_MUX_10_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_10_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_10_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_10_DC_0 - Clock Mux 10 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_10_DC_0_DIV_MASK              (0x70000U)
#define MC_CGM_MUX_10_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_10_DC_0_DIV_WIDTH             (3U)
#define MC_CGM_MUX_10_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_10_DC_0_DIV_SHIFT)) & MC_CGM_MUX_10_DC_0_DIV_MASK)

#define MC_CGM_MUX_10_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_MUX_10_DC_0_DE_SHIFT              (31U)
#define MC_CGM_MUX_10_DC_0_DE_WIDTH              (1U)
#define MC_CGM_MUX_10_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_10_DC_0_DE_SHIFT)) & MC_CGM_MUX_10_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_10_DIV_UPD_STAT - Clock Mux 10 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_11_CSC - Clock Mux 11 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_11_CSC_CG_MASK                (0x4U)
#define MC_CGM_MUX_11_CSC_CG_SHIFT               (2U)
#define MC_CGM_MUX_11_CSC_CG_WIDTH               (1U)
#define MC_CGM_MUX_11_CSC_CG(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSC_CG_SHIFT)) & MC_CGM_MUX_11_CSC_CG_MASK)

#define MC_CGM_MUX_11_CSC_FCG_MASK               (0x8U)
#define MC_CGM_MUX_11_CSC_FCG_SHIFT              (3U)
#define MC_CGM_MUX_11_CSC_FCG_WIDTH              (1U)
#define MC_CGM_MUX_11_CSC_FCG(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSC_FCG_SHIFT)) & MC_CGM_MUX_11_CSC_FCG_MASK)

#define MC_CGM_MUX_11_CSC_SELCTL_MASK            (0xF000000U)
#define MC_CGM_MUX_11_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_MUX_11_CSC_SELCTL_WIDTH           (4U)
#define MC_CGM_MUX_11_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_11_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_11_CSS - Clock Mux 11 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_11_CSS_GRIP_MASK              (0x10000U)
#define MC_CGM_MUX_11_CSS_GRIP_SHIFT             (16U)
#define MC_CGM_MUX_11_CSS_GRIP_WIDTH             (1U)
#define MC_CGM_MUX_11_CSS_GRIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSS_GRIP_SHIFT)) & MC_CGM_MUX_11_CSS_GRIP_MASK)

#define MC_CGM_MUX_11_CSS_CS_MASK                (0x20000U)
#define MC_CGM_MUX_11_CSS_CS_SHIFT               (17U)
#define MC_CGM_MUX_11_CSS_CS_WIDTH               (1U)
#define MC_CGM_MUX_11_CSS_CS(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSS_CS_SHIFT)) & MC_CGM_MUX_11_CSS_CS_MASK)

#define MC_CGM_MUX_11_CSS_SELSTAT_MASK           (0xF000000U)
#define MC_CGM_MUX_11_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_11_CSS_SELSTAT_WIDTH          (4U)
#define MC_CGM_MUX_11_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_11_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_11_DC_0 - Clock Mux 11 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_11_DC_0_DIV_MASK              (0xF0000U)
#define MC_CGM_MUX_11_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_11_DC_0_DIV_WIDTH             (4U)
#define MC_CGM_MUX_11_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_DC_0_DIV_SHIFT)) & MC_CGM_MUX_11_DC_0_DIV_MASK)

#define MC_CGM_MUX_11_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_MUX_11_DC_0_DE_SHIFT              (31U)
#define MC_CGM_MUX_11_DC_0_DE_WIDTH              (1U)
#define MC_CGM_MUX_11_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_DC_0_DE_SHIFT)) & MC_CGM_MUX_11_DC_0_DE_MASK)
/*! @} */

/*! @name MUX_11_DIV_UPD_STAT - Clock Mux 11 Divider Update Status Register */
/*! @{ */

#define MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_MUX_11_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name MUX_12_CSC - Clock Mux 12 Select Control Register */
/*! @{ */

#define MC_CGM_MUX_12_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_12_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_12_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_12_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSC_CLK_SW_SHIFT)) & MC_CGM_MUX_12_CSC_CLK_SW_MASK)

#define MC_CGM_MUX_12_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_12_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_12_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_12_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSC_SAFE_SW_SHIFT)) & MC_CGM_MUX_12_CSC_SAFE_SW_MASK)

#define MC_CGM_MUX_12_CSC_SELCTL_MASK            (0xF000000U)
#define MC_CGM_MUX_12_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_MUX_12_CSC_SELCTL_WIDTH           (4U)
#define MC_CGM_MUX_12_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSC_SELCTL_SHIFT)) & MC_CGM_MUX_12_CSC_SELCTL_MASK)
/*! @} */

/*! @name MUX_12_CSS - Clock Mux 12 Select Status Register */
/*! @{ */

#define MC_CGM_MUX_12_CSS_CLK_SW_MASK            (0x4U)
#define MC_CGM_MUX_12_CSS_CLK_SW_SHIFT           (2U)
#define MC_CGM_MUX_12_CSS_CLK_SW_WIDTH           (1U)
#define MC_CGM_MUX_12_CSS_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSS_CLK_SW_SHIFT)) & MC_CGM_MUX_12_CSS_CLK_SW_MASK)

#define MC_CGM_MUX_12_CSS_SAFE_SW_MASK           (0x8U)
#define MC_CGM_MUX_12_CSS_SAFE_SW_SHIFT          (3U)
#define MC_CGM_MUX_12_CSS_SAFE_SW_WIDTH          (1U)
#define MC_CGM_MUX_12_CSS_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSS_SAFE_SW_SHIFT)) & MC_CGM_MUX_12_CSS_SAFE_SW_MASK)

#define MC_CGM_MUX_12_CSS_SWIP_MASK              (0x10000U)
#define MC_CGM_MUX_12_CSS_SWIP_SHIFT             (16U)
#define MC_CGM_MUX_12_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_MUX_12_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSS_SWIP_SHIFT)) & MC_CGM_MUX_12_CSS_SWIP_MASK)

#define MC_CGM_MUX_12_CSS_SWTRG_MASK             (0xE0000U)
#define MC_CGM_MUX_12_CSS_SWTRG_SHIFT            (17U)
#define MC_CGM_MUX_12_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_MUX_12_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSS_SWTRG_SHIFT)) & MC_CGM_MUX_12_CSS_SWTRG_MASK)

#define MC_CGM_MUX_12_CSS_SELSTAT_MASK           (0xF000000U)
#define MC_CGM_MUX_12_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_MUX_12_CSS_SELSTAT_WIDTH          (4U)
#define MC_CGM_MUX_12_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_CSS_SELSTAT_SHIFT)) & MC_CGM_MUX_12_CSS_SELSTAT_MASK)
/*! @} */

/*! @name MUX_12_DC_0 - Clock Mux 12 Divider 0 Control Register */
/*! @{ */

#define MC_CGM_MUX_12_DC_0_DIV_MASK              (0x3F0000U)
#define MC_CGM_MUX_12_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_MUX_12_DC_0_DIV_WIDTH             (6U)
#define MC_CGM_MUX_12_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_MUX_12_DC_0_DIV_SHIFT)) & MC_CGM_MUX_12_DC_0_DIV_MASK)

